In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                 columns=['col01','col02','col03'],
                 index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [3]:
import numpy as np

In [4]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                 columns=['col01','col02','col03'],
                 index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [5]:
df.index

Index(['idx01', 'idx02', 'idx03'], dtype='object')

In [6]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [9]:
df = pd.DataFrame({'col01':[1,2,3],
                 'col02':[4,5,6],
                 'col03':[7,8,9]})


df

   col01  col02  col03
0      1      4      7
1      2      5      8
2      3      6      9

In [10]:
df = pd.DataFrame({'col01':[1,2,3],
                 'col02':[4,5,6],
                 'col03':[7,8,9]})

df.index=['idx01','idx02','idx03']
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [11]:
df = pd.DataFrame({'col01':[1,2,3],
                 'col02':[4,5,6],
                 'col03':[7,8,9]}
                  ,index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [13]:
df = pd.DataFrame([[1,2,3],
                 [4,5,6],
                 [7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
df.columns=['col01', 'col02', 'col03']
df.index=['idx01','idx02','idx03']

In [15]:
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [16]:
df.columns=['col04', 'col05', 'col06']

In [17]:
df

       col04  col05  col06
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [18]:
df = df.rename(columns={'col04':'x'})

In [19]:
df

       x  col05  col06
idx01  1      2      3
idx02  4      5      6
idx03  7      8      9

In [20]:
df['x']

idx01    1
idx02    4
idx03    7
Name: x, dtype: int64

In [22]:
type(df['x'])

pandas.core.series.Series

In [23]:
df[['x']]

       x
idx01  1
idx02  4
idx03  7

In [24]:
df.loc['idx01']

x        1
col05    2
col06    3
Name: idx01, dtype: int64